11. Create Student Table with ID as Primary Key and NOT NULL , Name as 20 Characters ,Age as Int value both are NOT NULL and Address have  25 charter And Insert Any 5 Records?

In [ ]:
##Creating the Student table
CREATE TABLE Student (
    ID INT PRIMARY KEY NOT NULL,
    Name VARCHAR(20) NOT NULL,
    Age INT NOT NULL,
    Address VARCHAR(25)
);

## Inserting records into the Student table
INSERT INTO Student (ID, Name, Age, Address)
VALUES (1, 'John Doe', 20, '123 Main St'),
       (2, 'Jane Smith', 22, '456 Elm St'),
       (3, 'Michael Johnson', 21, '789 Oak St'),
       (4, 'Emily Brown', 23, '321 Pine St'),
       (5, 'William Wilson', 19, '567 Maple St');

12.  Write an SQL query to find the youngest student in the "student" table ?

In [ ]:
SELECT *
FROM Student
ORDER BY Age ASC
LIMIT 1;